QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_gpio.h
#ifndef HW_GPIO_H
#define HW_GPIO_H

//*************************************************************************************************
//
// The following are defines for the GPIO register offsets
//
//*************************************************************************************************
#define GPIO_O_GPACTRL  0x0U  // GPIO A Qualification Sampling Period (GPIO0 to GPIO31)
#define GPIO_O_GPAQSEL1 0x4U  // GPIO A Qualification Type (GPIO0 to GPIO15)
#define GPIO_O_GPAQSEL2 0x8U  // GPIO A Qualification Type (GPIO16 to GPIO31)
#define GPIO_O_GPAMUX1  0xCU  // GPIO A Peripheral Mux (GPIO0 to GPIO15)
#define GPIO_O_GPAMUX2  0x10U // GPIO A Peripheral Mux (GPIO16 to GPIO31)
#define GPIO_O_GPADIR   0x14U // GPIO A Direction (GPIO0 to GPIO31)
#define GPIO_O_GPAPUD   0x18U // GPIO A Pull-Up Disable (GPIO0 to GPIO31)
#define GPIO_O_GPAINV   0x1CU // GPIO A Input Inversion (GPIO0 to GPIO31)
#define GPIO_O_GPAODR   0x20U // GPIO A Open Drain Output Mode (GPIO0 to GPIO31)
#define GPIO_O_GPAAMSEL 0x24U // GPIO A Analog Mode Select (GPIO0 to GPIO31)
#define GPIO_O_GPAGMUX1 0x28U // GPIO A Peripheral Group Mux (GPIO0 to GPIO15)
#define GPIO_O_GPAGMUX2 0x2CU // GPIO A Peripheral Group Mux (GPIO16 to GPIO31)
#define GPIO_O_GPALOCK  0x30U // GPIO A Lock Register (GPIO0 to GPIO31)
#define GPIO_O_GPACR    0x34U // GPIO A Lock Commit Register (GPIO0 to GPIO31)

#define GPIO_O_GPBCTRL  0x50U // GPIO B Qualification Sampling Period (GPIO32 to GPIO63)
#define GPIO_O_GPBQSEL1 0x54U // GPIO B Qualification Type (GPIO32 to GPIO47)
#define GPIO_O_GPBQSEL2 0x58U // GPIO B Qualification Type (GPIO48 to GPIO63)
#define GPIO_O_GPBMUX1  0x5CU // GPIO B Peripheral Mux (GPIO32 to GPIO47)
#define GPIO_O_GPBMUX2  0x60U // GPIO B Peripheral Mux (GPIO48 to GPIO63)
#define GPIO_O_GPBDIR   0x64U // GPIO B Direction (GPIO32 to GPIO63)
#define GPIO_O_GPBPUD   0x68U // GPIO B Pull-Up Disable (GPIO32 to GPIO63)
#define GPIO_O_GPBINV   0x6CU // GPIO B Input Inversion (GPIO32 to GPIO63)
#define GPIO_O_GPBODR   0x70U // GPIO B Open Drain Output Mode (GPIO32 to GPIO63)
#define GPIO_O_GPBGMUX1 0x78U // GPIO B Peripheral Group Mux (GPIO32 to GPIO47)
#define GPIO_O_GPBGMUX2 0x7CU // GPIO B Peripheral Group Mux (GPIO48 to GPIO63)
#define GPIO_O_GPBLOCK  0x80U // GPIO B Lock Register (GPIO32 to GPIO63)
#define GPIO_O_GPBCR    0x84U // GPIO B Lock Commit Register (GPIO32 to GPIO63)

#define GPIO_O_GPCCTRL  0xA0U // GPIO C Qualification Sampling Period (GPIO64 to GPIO95)
#define GPIO_O_GPCQSEL1 0xA4U // GPIO C Qualification Type (GPIO64 to GPIO79)
#define GPIO_O_GPCQSEL2 0xA8U // GPIO C Qualification Type (GPIO80 to GPIO95)
#define GPIO_O_GPCMUX1  0xACU // GPIO C Peripheral Mux (GPIO64 to GPIO95)
#define GPIO_O_GPCMUX2  0xB0U // GPIO C Peripheral Mux (GPIO64 to GPIO95)
#define GPIO_O_GPCDIR   0xB4U // GPIO C Direction (GPIO64 to GPIO95)
#define GPIO_O_GPCPUD   0xB8U // GPIO C Pull-Up Disable (GPIO64 to GPIO95)
#define GPIO_O_GPCINV   0xBCU // GPIO C Input Inversion (GPIO64 to GPIO95)
#define GPIO_O_GPCODR   0xC0U // GPIO C Open Drain Output Mode (GPIO64 to GPIO95)
#define GPIO_O_GPCGMUX1 0xC8U // GPIO C Peripheral Group Mux (GPIO64 to GPIO79)
#define GPIO_O_GPCGMUX2 0xCCU // GPIO C Peripheral Group Mux (GPIO80 to GPIO95)
#define GPIO_O_GPCLOCK  0xD0U // GPIO C Lock Register (GPIO64 to GPIO95)
#define GPIO_O_GPCCR    0xD4U // GPIO C Lock Commit Register (GPIO64 to GPIO95)

#define GPIO_O_GPDCTRL  0xF0U  // GPIO D Qualification Sampling Period (GPIO96 to GPIO127)
#define GPIO_O_GPDQSEL1 0xF4U  // GPIO D Qualification Type (GPIO96 to GPIO111)
#define GPIO_O_GPDQSEL2 0xF8U  // GPIO D Qualification Type (GPIO112 to GPIO127)
#define GPIO_O_GPDMUX1  0xFCU  // GPIO D Peripheral Mux (GPIO96 to GPIO111)
#define GPIO_O_GPDMUX2  0x100U // GPIO D Peripheral Mux (GPIO112 to GPIO127)
#define GPIO_O_GPDDIR   0x104U // GPIO D Direction (GPIO96 to GPIO127)
#define GPIO_O_GPDPUD   0x108U // GPIO D Pull-Up Disable (GPIO96 to GPIO127)
#define GPIO_O_GPDINV   0x10CU // GPIO D Input Inversion (GPIO96 to GPIO127)
#define GPIO_O_GPDODR   0x110U // GPIO D Open Drain Output Mode (GPIO96 to GPIO127)
#define GPIO_O_GPDGMUX1 0x118U // GPIO D Peripheral Group Mux (GPIO96 to GPIO111)
#define GPIO_O_GPDGMUX2 0x11CU // GPIO D Peripheral Group Mux (GPIO112 to GPIO127)
#define GPIO_O_GPDLOCK  0x120U // GPIO D Lock Register (GPIO96 to GPIO127)
#define GPIO_O_GPDCR    0x124U // GPIO D Lock Commit Register (GPIO96 to GPIO127)

#define GPIO_O_GPHCTRL  0x230U // GPIO H Qualification Sampling Period (GPIO224 to GPIO255)
#define GPIO_O_GPHQSEL1 0x234U // GPIO H Qualification Type (GPIO224 to GPIO239)
#define GPIO_O_GPHQSEL2 0x238U // GPIO H Qualification Type (GPIO240 to GPIO255)
#define GPIO_O_GPHDIR   0x244U // GPIO H Direction (GPIO224 to GPIO255)
#define GPIO_O_GPHPUD   0x248U // GPIO H Pull-Up Disable (GPIO224 to GPIO255)
#define GPIO_O_GPHINV   0x24CU // GPIO H Input Inversion (GPIO224 to GPIO255)
#define GPIO_O_GPHODR   0x250U // GPIO H Open Drain Output Mode (GPIO224 to GPIO255)
#define GPIO_O_GPHAMSEL 0x254U // GPIO H Analog Mode Select (GPIO224 to GPIO255)
#define GPIO_O_GPHLOCK  0x260U // GPIO H Lock Register (GPIO224 to GPIO255)
#define GPIO_O_GPHCR    0x264U // GPIO H Lock Commit Register (GPIO224 to GPIO255)

#define GPIO_O_GPADAT    0x0U  // GPIO A Data Register (GPIO0 to GPIO31)
#define GPIO_O_GPASET    0x4U  // GPIO A Output Set (GPIO0 to GPIO31)
#define GPIO_O_GPACLEAR  0x8U  // GPIO A Output Clear (GPIO0 to GPIO31)
#define GPIO_O_GPATOGGLE 0xCU  // GPIO A Output Toggle (GPIO0 to GPIO31)
#define GPIO_O_GPBDAT    0x10U // GPIO B Data Register (GPIO32 to GPIO64)
#define GPIO_O_GPBSET    0x14U // GPIO B Output Set (GPIO32 to GPIO64)
#define GPIO_O_GPBCLEAR  0x18U // GPIO B Output Clear (GPIO32 to GPIO64)
#define GPIO_O_GPBTOGGLE 0x1CU // GPIO B Output Toggle (GPIO32 to GPIO64)
#define GPIO_O_GPCDAT    0x20U // GPIO C Data Register (GPIO64 to GPIO95)
#define GPIO_O_GPCSET    0x24U // GPIO C Output Set (GPIO64 to GPIO95)
#define GPIO_O_GPCCLEAR  0x28U // GPIO C Output Clear (GPIO64 to GPIO95)
#define GPIO_O_GPCTOGGLE 0x2CU // GPIO C Output Toggle (GPIO64 to GPIO95)
#define GPIO_O_GPDDAT    0x30U // GPIO D Data Register (GPIO96 to GPIO127)
#define GPIO_O_GPDSET    0x34U // GPIO D Output Set (GPIO96 to GPIO127)
#define GPIO_O_GPDCLEAR  0x38U // GPIO D Output Clear (GPIO96 to GPIO127)
#define GPIO_O_GPDTOGGLE 0x3CU // GPIO D Output Toggle (GPIO96 to GPIO127)
#define GPIO_O_GPHDAT    0x70U // GPIO H Data Register (GPIO224 to GPIO255)
#define GPIO_O_GPHSET    0x74U // GPIO H Output Set (GPIO224 to GPIO255)
#define GPIO_O_GPHCLEAR  0x78U // GPIO H Output Clear (GPIO224 to GPIO255)
#define GPIO_O_GPHTOGGLE 0x7CU // GPIO H Output Toggle (GPIO224 to GPIO255)

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACTRL register
//
//*************************************************************************************************
#define GPIO_GPACTRL_QUALPRD0_S 0U
#define GPIO_GPACTRL_QUALPRD0_M 0xFFU // Qualification sampling period for GPIO0 to GPIO7
#define GPIO_GPACTRL_QUALPRD1_S 8U
#define GPIO_GPACTRL_QUALPRD1_M \
    0xFF00U // Qualification sampling period for GPIO8 to
            // GPIO15
#define GPIO_GPACTRL_QUALPRD2_S 16U
#define GPIO_GPACTRL_QUALPRD2_M \
    0xFF0000U // Qualification sampling period for GPIO16 to
              // GPIO23
#define GPIO_GPACTRL_QUALPRD3_S 24U
#define GPIO_GPACTRL_QUALPRD3_M \
    0xFF000000U // Qualification sampling period for GPIO24 to
                // GPIO31

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPAQSEL1_GPIO0_S  0U
#define GPIO_GPAQSEL1_GPIO0_M  0x3U // Select input qualification type for GPIO0
#define GPIO_GPAQSEL1_GPIO1_S  2U
#define GPIO_GPAQSEL1_GPIO1_M  0xCU // Select input qualification type for GPIO1
#define GPIO_GPAQSEL1_GPIO2_S  4U
#define GPIO_GPAQSEL1_GPIO2_M  0x30U // Select input qualification type for GPIO2
#define GPIO_GPAQSEL1_GPIO3_S  6U
#define GPIO_GPAQSEL1_GPIO3_M  0xC0U // Select input qualification type for GPIO3
#define GPIO_GPAQSEL1_GPIO4_S  8U
#define GPIO_GPAQSEL1_GPIO4_M  0x300U // Select input qualification type for GPIO4
#define GPIO_GPAQSEL1_GPIO5_S  10U
#define GPIO_GPAQSEL1_GPIO5_M  0xC00U // Select input qualification type for GPIO5
#define GPIO_GPAQSEL1_GPIO6_S  12U
#define GPIO_GPAQSEL1_GPIO6_M  0x3000U // Select input qualification type for GPIO6
#define GPIO_GPAQSEL1_GPIO7_S  14U
#define GPIO_GPAQSEL1_GPIO7_M  0xC000U // Select input qualification type for GPIO7
#define GPIO_GPAQSEL1_GPIO8_S  16U
#define GPIO_GPAQSEL1_GPIO8_M  0x30000U // Select input qualification type for GPIO8
#define GPIO_GPAQSEL1_GPIO9_S  18U
#define GPIO_GPAQSEL1_GPIO9_M  0xC0000U // Select input qualification type for GPIO9
#define GPIO_GPAQSEL1_GPIO10_S 20U
#define GPIO_GPAQSEL1_GPIO10_M 0x300000U // Select input qualification type for GPIO10
#define GPIO_GPAQSEL1_GPIO11_S 22U
#define GPIO_GPAQSEL1_GPIO11_M 0xC00000U // Select input qualification type for GPIO11
#define GPIO_GPAQSEL1_GPIO12_S 24U
#define GPIO_GPAQSEL1_GPIO12_M 0x3000000U // Select input qualification type for GPIO12
#define GPIO_GPAQSEL1_GPIO13_S 26U
#define GPIO_GPAQSEL1_GPIO13_M 0xC000000U // Select input qualification type for GPIO13
#define GPIO_GPAQSEL1_GPIO14_S 28U
#define GPIO_GPAQSEL1_GPIO14_M 0x30000000U // Select input qualification type for GPIO14
#define GPIO_GPAQSEL1_GPIO15_S 30U
#define GPIO_GPAQSEL1_GPIO15_M 0xC0000000U // Select input qualification type for GPIO15

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPAQSEL2_GPIO16_S 0U
#define GPIO_GPAQSEL2_GPIO16_M 0x3U // Select input qualification type for GPIO16
#define GPIO_GPAQSEL2_GPIO17_S 2U
#define GPIO_GPAQSEL2_GPIO17_M 0xCU // Select input qualification type for GPIO17
#define GPIO_GPAQSEL2_GPIO18_S 4U
#define GPIO_GPAQSEL2_GPIO18_M 0x30U // Select input qualification type for GPIO18
#define GPIO_GPAQSEL2_GPIO19_S 6U
#define GPIO_GPAQSEL2_GPIO19_M 0xC0U // Select input qualification type for GPIO19
#define GPIO_GPAQSEL2_GPIO20_S 8U
#define GPIO_GPAQSEL2_GPIO20_M 0x300U // Select input qualification type for GPIO20
#define GPIO_GPAQSEL2_GPIO21_S 10U
#define GPIO_GPAQSEL2_GPIO21_M 0xC00U // Select input qualification type for GPIO21
#define GPIO_GPAQSEL2_GPIO22_S 12U
#define GPIO_GPAQSEL2_GPIO22_M 0x3000U // Select input qualification type for GPIO22
#define GPIO_GPAQSEL2_GPIO23_S 14U
#define GPIO_GPAQSEL2_GPIO23_M 0xC000U // Select input qualification type for GPIO23
#define GPIO_GPAQSEL2_GPIO24_S 16U
#define GPIO_GPAQSEL2_GPIO24_M 0x30000U // Select input qualification type for GPIO24
#define GPIO_GPAQSEL2_GPIO25_S 18U
#define GPIO_GPAQSEL2_GPIO25_M 0xC0000U // Select input qualification type for GPIO25
#define GPIO_GPAQSEL2_GPIO26_S 20U
#define GPIO_GPAQSEL2_GPIO26_M 0x300000U // Select input qualification type for GPIO26
#define GPIO_GPAQSEL2_GPIO27_S 22U
#define GPIO_GPAQSEL2_GPIO27_M 0xC00000U // Select input qualification type for GPIO27
#define GPIO_GPAQSEL2_GPIO28_S 24U
#define GPIO_GPAQSEL2_GPIO28_M 0x3000000U // Select input qualification type for GPIO28
#define GPIO_GPAQSEL2_GPIO29_S 26U
#define GPIO_GPAQSEL2_GPIO29_M 0xC000000U // Select input qualification type for GPIO29
#define GPIO_GPAQSEL2_GPIO30_S 28U
#define GPIO_GPAQSEL2_GPIO30_M 0x30000000U // Select input qualification type for GPIO30
#define GPIO_GPAQSEL2_GPIO31_S 30U
#define GPIO_GPAQSEL2_GPIO31_M 0xC0000000U // Select input qualification type for GPIO31

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAMUX1 register
//
//*************************************************************************************************
#define GPIO_GPAMUX1_GPIO0_S  0U
#define GPIO_GPAMUX1_GPIO0_M  0x3U // Defines pin-muxing selection for GPIO0
#define GPIO_GPAMUX1_GPIO1_S  2U
#define GPIO_GPAMUX1_GPIO1_M  0xCU // Defines pin-muxing selection for GPIO1
#define GPIO_GPAMUX1_GPIO2_S  4U
#define GPIO_GPAMUX1_GPIO2_M  0x30U // Defines pin-muxing selection for GPIO2
#define GPIO_GPAMUX1_GPIO3_S  6U
#define GPIO_GPAMUX1_GPIO3_M  0xC0U // Defines pin-muxing selection for GPIO3
#define GPIO_GPAMUX1_GPIO4_S  8U
#define GPIO_GPAMUX1_GPIO4_M  0x300U // Defines pin-muxing selection for GPIO4
#define GPIO_GPAMUX1_GPIO5_S  10U
#define GPIO_GPAMUX1_GPIO5_M  0xC00U // Defines pin-muxing selection for GPIO5
#define GPIO_GPAMUX1_GPIO6_S  12U
#define GPIO_GPAMUX1_GPIO6_M  0x3000U // Defines pin-muxing selection for GPIO6
#define GPIO_GPAMUX1_GPIO7_S  14U
#define GPIO_GPAMUX1_GPIO7_M  0xC000U // Defines pin-muxing selection for GPIO7
#define GPIO_GPAMUX1_GPIO8_S  16U
#define GPIO_GPAMUX1_GPIO8_M  0x30000U // Defines pin-muxing selection for GPIO8
#define GPIO_GPAMUX1_GPIO9_S  18U
#define GPIO_GPAMUX1_GPIO9_M  0xC0000U // Defines pin-muxing selection for GPIO9
#define GPIO_GPAMUX1_GPIO10_S 20U
#define GPIO_GPAMUX1_GPIO10_M 0x300000U // Defines pin-muxing selection for GPIO10
#define GPIO_GPAMUX1_GPIO11_S 22U
#define GPIO_GPAMUX1_GPIO11_M 0xC00000U // Defines pin-muxing selection for GPIO11
#define GPIO_GPAMUX1_GPIO12_S 24U
#define GPIO_GPAMUX1_GPIO12_M 0x3000000U // Defines pin-muxing selection for GPIO12
#define GPIO_GPAMUX1_GPIO13_S 26U
#define GPIO_GPAMUX1_GPIO13_M 0xC000000U // Defines pin-muxing selection for GPIO13
#define GPIO_GPAMUX1_GPIO14_S 28U
#define GPIO_GPAMUX1_GPIO14_M 0x30000000U // Defines pin-muxing selection for GPIO14
#define GPIO_GPAMUX1_GPIO15_S 30U
#define GPIO_GPAMUX1_GPIO15_M 0xC0000000U // Defines pin-muxing selection for GPIO15

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAMUX2 register
//
//*************************************************************************************************
#define GPIO_GPAMUX2_GPIO16_S 0U
#define GPIO_GPAMUX2_GPIO16_M 0x3U // Defines pin-muxing selection for GPIO16
#define GPIO_GPAMUX2_GPIO17_S 2U
#define GPIO_GPAMUX2_GPIO17_M 0xCU // Defines pin-muxing selection for GPIO17
#define GPIO_GPAMUX2_GPIO18_S 4U
#define GPIO_GPAMUX2_GPIO18_M 0x30U // Defines pin-muxing selection for GPIO18
#define GPIO_GPAMUX2_GPIO19_S 6U
#define GPIO_GPAMUX2_GPIO19_M 0xC0U // Defines pin-muxing selection for GPIO19
#define GPIO_GPAMUX2_GPIO20_S 8U
#define GPIO_GPAMUX2_GPIO20_M 0x300U // Defines pin-muxing selection for GPIO20
#define GPIO_GPAMUX2_GPIO21_S 10U
#define GPIO_GPAMUX2_GPIO21_M 0xC00U // Defines pin-muxing selection for GPIO21
#define GPIO_GPAMUX2_GPIO22_S 12U
#define GPIO_GPAMUX2_GPIO22_M 0x3000U // Defines pin-muxing selection for GPIO22
#define GPIO_GPAMUX2_GPIO23_S 14U
#define GPIO_GPAMUX2_GPIO23_M 0xC000U // Defines pin-muxing selection for GPIO23
#define GPIO_GPAMUX2_GPIO24_S 16U
#define GPIO_GPAMUX2_GPIO24_M 0x30000U // Defines pin-muxing selection for GPIO24
#define GPIO_GPAMUX2_GPIO25_S 18U
#define GPIO_GPAMUX2_GPIO25_M 0xC0000U // Defines pin-muxing selection for GPIO25
#define GPIO_GPAMUX2_GPIO26_S 20U
#define GPIO_GPAMUX2_GPIO26_M 0x300000U // Defines pin-muxing selection for GPIO26
#define GPIO_GPAMUX2_GPIO27_S 22U
#define GPIO_GPAMUX2_GPIO27_M 0xC00000U // Defines pin-muxing selection for GPIO27
#define GPIO_GPAMUX2_GPIO28_S 24U
#define GPIO_GPAMUX2_GPIO28_M 0x3000000U // Defines pin-muxing selection for GPIO28
#define GPIO_GPAMUX2_GPIO29_S 26U
#define GPIO_GPAMUX2_GPIO29_M 0xC000000U // Defines pin-muxing selection for GPIO29
#define GPIO_GPAMUX2_GPIO30_S 28U
#define GPIO_GPAMUX2_GPIO30_M 0x30000000U // Defines pin-muxing selection for GPIO30
#define GPIO_GPAMUX2_GPIO31_S 30U
#define GPIO_GPAMUX2_GPIO31_M 0xC0000000U // Defines pin-muxing selection for GPIO31

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPADIR register
//
//*************************************************************************************************
#define GPIO_GPADIR_GPIO0  0x1U        // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO1  0x2U        // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO2  0x4U        // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO3  0x8U        // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO4  0x10U       // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO5  0x20U       // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO6  0x40U       // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO7  0x80U       // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO8  0x100U      // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO9  0x200U      // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO10 0x400U      // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO11 0x800U      // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO12 0x1000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO13 0x2000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO14 0x4000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO15 0x8000U     // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO16 0x10000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO17 0x20000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO18 0x40000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO19 0x80000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO20 0x100000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO21 0x200000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO22 0x400000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO23 0x800000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO24 0x1000000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO25 0x2000000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO26 0x4000000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO27 0x8000000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO28 0x10000000U // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO29 0x20000000U // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO30 0x40000000U // Defines direction for this pin in GPIO mode
#define GPIO_GPADIR_GPIO31 0x80000000U // Defines direction for this pin in GPIO mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAPUD register
//
//*************************************************************************************************
#define GPIO_GPAPUD_GPIO0  0x1U        // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO1  0x2U        // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO2  0x4U        // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO3  0x8U        // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO4  0x10U       // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO5  0x20U       // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO6  0x40U       // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO7  0x80U       // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO8  0x100U      // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO9  0x200U      // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO10 0x400U      // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO11 0x800U      // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO12 0x1000U     // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO13 0x2000U     // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO14 0x4000U     // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO15 0x8000U     // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO16 0x10000U    // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO17 0x20000U    // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO18 0x40000U    // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO19 0x80000U    // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO20 0x100000U   // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO21 0x200000U   // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO22 0x400000U   // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO23 0x800000U   // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO24 0x1000000U  // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO25 0x2000000U  // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO26 0x4000000U  // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO27 0x8000000U  // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO28 0x10000000U // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO29 0x20000000U // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO30 0x40000000U // Pull-Up Disable control for this pin
#define GPIO_GPAPUD_GPIO31 0x80000000U // Pull-Up Disable control for this pin

