QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAINV register
//
//*************************************************************************************************
#define GPIO_GPAINV_GPIO0  0x1U        // Input inversion control for this pin
#define GPIO_GPAINV_GPIO1  0x2U        // Input inversion control for this pin
#define GPIO_GPAINV_GPIO2  0x4U        // Input inversion control for this pin
#define GPIO_GPAINV_GPIO3  0x8U        // Input inversion control for this pin
#define GPIO_GPAINV_GPIO4  0x10U       // Input inversion control for this pin
#define GPIO_GPAINV_GPIO5  0x20U       // Input inversion control for this pin
#define GPIO_GPAINV_GPIO6  0x40U       // Input inversion control for this pin
#define GPIO_GPAINV_GPIO7  0x80U       // Input inversion control for this pin
#define GPIO_GPAINV_GPIO8  0x100U      // Input inversion control for this pin
#define GPIO_GPAINV_GPIO9  0x200U      // Input inversion control for this pin
#define GPIO_GPAINV_GPIO10 0x400U      // Input inversion control for this pin
#define GPIO_GPAINV_GPIO11 0x800U      // Input inversion control for this pin
#define GPIO_GPAINV_GPIO12 0x1000U     // Input inversion control for this pin
#define GPIO_GPAINV_GPIO13 0x2000U     // Input inversion control for this pin
#define GPIO_GPAINV_GPIO14 0x4000U     // Input inversion control for this pin
#define GPIO_GPAINV_GPIO15 0x8000U     // Input inversion control for this pin
#define GPIO_GPAINV_GPIO16 0x10000U    // Input inversion control for this pin
#define GPIO_GPAINV_GPIO17 0x20000U    // Input inversion control for this pin
#define GPIO_GPAINV_GPIO18 0x40000U    // Input inversion control for this pin
#define GPIO_GPAINV_GPIO19 0x80000U    // Input inversion control for this pin
#define GPIO_GPAINV_GPIO20 0x100000U   // Input inversion control for this pin
#define GPIO_GPAINV_GPIO21 0x200000U   // Input inversion control for this pin
#define GPIO_GPAINV_GPIO22 0x400000U   // Input inversion control for this pin
#define GPIO_GPAINV_GPIO23 0x800000U   // Input inversion control for this pin
#define GPIO_GPAINV_GPIO24 0x1000000U  // Input inversion control for this pin
#define GPIO_GPAINV_GPIO25 0x2000000U  // Input inversion control for this pin
#define GPIO_GPAINV_GPIO26 0x4000000U  // Input inversion control for this pin
#define GPIO_GPAINV_GPIO27 0x8000000U  // Input inversion control for this pin
#define GPIO_GPAINV_GPIO28 0x10000000U // Input inversion control for this pin
#define GPIO_GPAINV_GPIO29 0x20000000U // Input inversion control for this pin
#define GPIO_GPAINV_GPIO30 0x40000000U // Input inversion control for this pin
#define GPIO_GPAINV_GPIO31 0x80000000U // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAODR register
//
//*************************************************************************************************
#define GPIO_GPAODR_GPIO0  0x1U        // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO1  0x2U        // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO2  0x4U        // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO3  0x8U        // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO4  0x10U       // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO5  0x20U       // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO6  0x40U       // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO7  0x80U       // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO8  0x100U      // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO9  0x200U      // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO10 0x400U      // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO11 0x800U      // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO12 0x1000U     // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO13 0x2000U     // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO14 0x4000U     // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO15 0x8000U     // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO16 0x10000U    // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO17 0x20000U    // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO18 0x40000U    // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO19 0x80000U    // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO20 0x100000U   // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO21 0x200000U   // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO22 0x400000U   // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO23 0x800000U   // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO24 0x1000000U  // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO25 0x2000000U  // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO26 0x4000000U  // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO27 0x8000000U  // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO28 0x10000000U // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO29 0x20000000U // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO30 0x40000000U // Output Open-Drain control for this pin
#define GPIO_GPAODR_GPIO31 0x80000000U // Output Open-Drain control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAAMSEL register
//
//*************************************************************************************************
#define GPIO_GPAAMSEL_GPIO22 0x400000U // Analog Mode select for this pin
#define GPIO_GPAAMSEL_GPIO23 0x800000U // Analog Mode select for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPAGMUX1_GPIO0_S  0U
#define GPIO_GPAGMUX1_GPIO0_M  0x3U // Defines pin-muxing selection for GPIO0
#define GPIO_GPAGMUX1_GPIO1_S  2U
#define GPIO_GPAGMUX1_GPIO1_M  0xCU // Defines pin-muxing selection for GPIO1
#define GPIO_GPAGMUX1_GPIO2_S  4U
#define GPIO_GPAGMUX1_GPIO2_M  0x30U // Defines pin-muxing selection for GPIO2
#define GPIO_GPAGMUX1_GPIO3_S  6U
#define GPIO_GPAGMUX1_GPIO3_M  0xC0U // Defines pin-muxing selection for GPIO3
#define GPIO_GPAGMUX1_GPIO4_S  8U
#define GPIO_GPAGMUX1_GPIO4_M  0x300U // Defines pin-muxing selection for GPIO4
#define GPIO_GPAGMUX1_GPIO5_S  10U
#define GPIO_GPAGMUX1_GPIO5_M  0xC00U // Defines pin-muxing selection for GPIO5
#define GPIO_GPAGMUX1_GPIO6_S  12U
#define GPIO_GPAGMUX1_GPIO6_M  0x3000U // Defines pin-muxing selection for GPIO6
#define GPIO_GPAGMUX1_GPIO7_S  14U
#define GPIO_GPAGMUX1_GPIO7_M  0xC000U // Defines pin-muxing selection for GPIO7
#define GPIO_GPAGMUX1_GPIO8_S  16U
#define GPIO_GPAGMUX1_GPIO8_M  0x30000U // Defines pin-muxing selection for GPIO8
#define GPIO_GPAGMUX1_GPIO9_S  18U
#define GPIO_GPAGMUX1_GPIO9_M  0xC0000U // Defines pin-muxing selection for GPIO9
#define GPIO_GPAGMUX1_GPIO10_S 20U
#define GPIO_GPAGMUX1_GPIO10_M 0x300000U // Defines pin-muxing selection for GPIO10
#define GPIO_GPAGMUX1_GPIO11_S 22U
#define GPIO_GPAGMUX1_GPIO11_M 0xC00000U // Defines pin-muxing selection for GPIO11
#define GPIO_GPAGMUX1_GPIO12_S 24U
#define GPIO_GPAGMUX1_GPIO12_M 0x3000000U // Defines pin-muxing selection for GPIO12
#define GPIO_GPAGMUX1_GPIO13_S 26U
#define GPIO_GPAGMUX1_GPIO13_M 0xC000000U // Defines pin-muxing selection for GPIO13
#define GPIO_GPAGMUX1_GPIO14_S 28U
#define GPIO_GPAGMUX1_GPIO14_M 0x30000000U // Defines pin-muxing selection for GPIO14
#define GPIO_GPAGMUX1_GPIO15_S 30U
#define GPIO_GPAGMUX1_GPIO15_M 0xC0000000U // Defines pin-muxing selection for GPIO15

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPAGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPAGMUX2_GPIO16_S 0U
#define GPIO_GPAGMUX2_GPIO16_M 0x3U // Defines pin-muxing selection for GPIO16
#define GPIO_GPAGMUX2_GPIO17_S 2U
#define GPIO_GPAGMUX2_GPIO17_M 0xCU // Defines pin-muxing selection for GPIO17
#define GPIO_GPAGMUX2_GPIO18_S 4U
#define GPIO_GPAGMUX2_GPIO18_M 0x30U // Defines pin-muxing selection for GPIO18
#define GPIO_GPAGMUX2_GPIO19_S 6U
#define GPIO_GPAGMUX2_GPIO19_M 0xC0U // Defines pin-muxing selection for GPIO19
#define GPIO_GPAGMUX2_GPIO20_S 8U
#define GPIO_GPAGMUX2_GPIO20_M 0x300U // Defines pin-muxing selection for GPIO20
#define GPIO_GPAGMUX2_GPIO21_S 10U
#define GPIO_GPAGMUX2_GPIO21_M 0xC00U // Defines pin-muxing selection for GPIO21
#define GPIO_GPAGMUX2_GPIO22_S 12U
#define GPIO_GPAGMUX2_GPIO22_M 0x3000U // Defines pin-muxing selection for GPIO22
#define GPIO_GPAGMUX2_GPIO23_S 14U
#define GPIO_GPAGMUX2_GPIO23_M 0xC000U // Defines pin-muxing selection for GPIO23
#define GPIO_GPAGMUX2_GPIO24_S 16U
#define GPIO_GPAGMUX2_GPIO24_M 0x30000U // Defines pin-muxing selection for GPIO24
#define GPIO_GPAGMUX2_GPIO25_S 18U
#define GPIO_GPAGMUX2_GPIO25_M 0xC0000U // Defines pin-muxing selection for GPIO25
#define GPIO_GPAGMUX2_GPIO26_S 20U
#define GPIO_GPAGMUX2_GPIO26_M 0x300000U // Defines pin-muxing selection for GPIO26
#define GPIO_GPAGMUX2_GPIO27_S 22U
#define GPIO_GPAGMUX2_GPIO27_M 0xC00000U // Defines pin-muxing selection for GPIO27
#define GPIO_GPAGMUX2_GPIO28_S 24U
#define GPIO_GPAGMUX2_GPIO28_M 0x3000000U // Defines pin-muxing selection for GPIO28
#define GPIO_GPAGMUX2_GPIO29_S 26U
#define GPIO_GPAGMUX2_GPIO29_M 0xC000000U // Defines pin-muxing selection for GPIO29
#define GPIO_GPAGMUX2_GPIO30_S 28U
#define GPIO_GPAGMUX2_GPIO30_M 0x30000000U // Defines pin-muxing selection for GPIO30
#define GPIO_GPAGMUX2_GPIO31_S 30U
#define GPIO_GPAGMUX2_GPIO31_M 0xC0000000U // Defines pin-muxing selection for GPIO31

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACSEL1 register
//
//*************************************************************************************************
#define GPIO_GPACSEL1_GPIO0_S 0U
#define GPIO_GPACSEL1_GPIO0_M 0xFU // GPIO0 Master CPU Select
#define GPIO_GPACSEL1_GPIO1_S 4U
#define GPIO_GPACSEL1_GPIO1_M 0xF0U // GPIO1 Master CPU Select
#define GPIO_GPACSEL1_GPIO2_S 8U
#define GPIO_GPACSEL1_GPIO2_M 0xF00U // GPIO2 Master CPU Select
#define GPIO_GPACSEL1_GPIO3_S 12U
#define GPIO_GPACSEL1_GPIO3_M 0xF000U // GPIO3 Master CPU Select
#define GPIO_GPACSEL1_GPIO4_S 16U
#define GPIO_GPACSEL1_GPIO4_M 0xF0000U // GPIO4 Master CPU Select
#define GPIO_GPACSEL1_GPIO5_S 20U
#define GPIO_GPACSEL1_GPIO5_M 0xF00000U // GPIO5 Master CPU Select
#define GPIO_GPACSEL1_GPIO6_S 24U
#define GPIO_GPACSEL1_GPIO6_M 0xF000000U // GPIO6 Master CPU Select
#define GPIO_GPACSEL1_GPIO7_S 28U
#define GPIO_GPACSEL1_GPIO7_M 0xF0000000U // GPIO7 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACSEL2 register
//
//*************************************************************************************************
#define GPIO_GPACSEL2_GPIO8_S  0U
#define GPIO_GPACSEL2_GPIO8_M  0xFU // GPIO8 Master CPU Select
#define GPIO_GPACSEL2_GPIO9_S  4U
#define GPIO_GPACSEL2_GPIO9_M  0xF0U // GPIO9 Master CPU Select
#define GPIO_GPACSEL2_GPIO10_S 8U
#define GPIO_GPACSEL2_GPIO10_M 0xF00U // GPIO10 Master CPU Select
#define GPIO_GPACSEL2_GPIO11_S 12U
#define GPIO_GPACSEL2_GPIO11_M 0xF000U // GPIO11 Master CPU Select
#define GPIO_GPACSEL2_GPIO12_S 16U
#define GPIO_GPACSEL2_GPIO12_M 0xF0000U // GPIO12 Master CPU Select
#define GPIO_GPACSEL2_GPIO13_S 20U
#define GPIO_GPACSEL2_GPIO13_M 0xF00000U // GPIO13 Master CPU Select
#define GPIO_GPACSEL2_GPIO14_S 24U
#define GPIO_GPACSEL2_GPIO14_M 0xF000000U // GPIO14 Master CPU Select
#define GPIO_GPACSEL2_GPIO15_S 28U
#define GPIO_GPACSEL2_GPIO15_M 0xF0000000U // GPIO15 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACSEL3 register
//
//*************************************************************************************************
#define GPIO_GPACSEL3_GPIO16_S 0U
#define GPIO_GPACSEL3_GPIO16_M 0xFU // GPIO16 Master CPU Select
#define GPIO_GPACSEL3_GPIO17_S 4U
#define GPIO_GPACSEL3_GPIO17_M 0xF0U // GPIO17 Master CPU Select
#define GPIO_GPACSEL3_GPIO18_S 8U
#define GPIO_GPACSEL3_GPIO18_M 0xF00U // GPIO18 Master CPU Select
#define GPIO_GPACSEL3_GPIO19_S 12U
#define GPIO_GPACSEL3_GPIO19_M 0xF000U // GPIO19 Master CPU Select
#define GPIO_GPACSEL3_GPIO20_S 16U
#define GPIO_GPACSEL3_GPIO20_M 0xF0000U // GPIO20 Master CPU Select
#define GPIO_GPACSEL3_GPIO21_S 20U
#define GPIO_GPACSEL3_GPIO21_M 0xF00000U // GPIO21 Master CPU Select
#define GPIO_GPACSEL3_GPIO22_S 24U
#define GPIO_GPACSEL3_GPIO22_M 0xF000000U // GPIO22 Master CPU Select
#define GPIO_GPACSEL3_GPIO23_S 28U
#define GPIO_GPACSEL3_GPIO23_M 0xF0000000U // GPIO23 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACSEL4 register
//
//*************************************************************************************************
#define GPIO_GPACSEL4_GPIO24_S 0U
#define GPIO_GPACSEL4_GPIO24_M 0xFU // GPIO24 Master CPU Select
#define GPIO_GPACSEL4_GPIO25_S 4U
#define GPIO_GPACSEL4_GPIO25_M 0xF0U // GPIO25 Master CPU Select
#define GPIO_GPACSEL4_GPIO26_S 8U
#define GPIO_GPACSEL4_GPIO26_M 0xF00U // GPIO26 Master CPU Select
#define GPIO_GPACSEL4_GPIO27_S 12U
#define GPIO_GPACSEL4_GPIO27_M 0xF000U // GPIO27 Master CPU Select
#define GPIO_GPACSEL4_GPIO28_S 16U
#define GPIO_GPACSEL4_GPIO28_M 0xF0000U // GPIO28 Master CPU Select
#define GPIO_GPACSEL4_GPIO29_S 20U
#define GPIO_GPACSEL4_GPIO29_M 0xF00000U // GPIO29 Master CPU Select
#define GPIO_GPACSEL4_GPIO30_S 24U
#define GPIO_GPACSEL4_GPIO30_M 0xF000000U // GPIO30 Master CPU Select
#define GPIO_GPACSEL4_GPIO31_S 28U
#define GPIO_GPACSEL4_GPIO31_M 0xF0000000U // GPIO31 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPALOCK register
//
//*************************************************************************************************
#define GPIO_GPALOCK_GPIO0  0x1U        // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO1  0x2U        // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO2  0x4U        // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO3  0x8U        // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO4  0x10U       // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO5  0x20U       // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO6  0x40U       // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO7  0x80U       // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO8  0x100U      // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO9  0x200U      // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO10 0x400U      // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO11 0x800U      // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO12 0x1000U     // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO13 0x2000U     // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO14 0x4000U     // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO15 0x8000U     // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO16 0x10000U    // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO17 0x20000U    // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO18 0x40000U    // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO19 0x80000U    // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO20 0x100000U   // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO21 0x200000U   // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO22 0x400000U   // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO23 0x800000U   // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO24 0x1000000U  // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO25 0x2000000U  // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO26 0x4000000U  // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO27 0x8000000U  // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO28 0x10000000U // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO29 0x20000000U // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO30 0x40000000U // Configuration Lock bit for this pin
#define GPIO_GPALOCK_GPIO31 0x80000000U // Configuration Lock bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPACR register
//
//*************************************************************************************************
#define GPIO_GPACR_GPIO0  0x1U        // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO1  0x2U        // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO2  0x4U        // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO3  0x8U        // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO4  0x10U       // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO5  0x20U       // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO6  0x40U       // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO7  0x80U       // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO8  0x100U      // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO9  0x200U      // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO10 0x400U      // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO11 0x800U      // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO12 0x1000U     // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO13 0x2000U     // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO14 0x4000U     // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO15 0x8000U     // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO16 0x10000U    // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO17 0x20000U    // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO18 0x40000U    // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO19 0x80000U    // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO20 0x100000U   // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO21 0x200000U   // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO22 0x400000U   // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO23 0x800000U   // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO24 0x1000000U  // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO25 0x2000000U  // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO26 0x4000000U  // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO27 0x8000000U  // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO28 0x10000000U // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO29 0x20000000U // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO30 0x40000000U // Configuration lock commit bit for this pin
#define GPIO_GPACR_GPIO31 0x80000000U // Configuration lock commit bit for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCTRL register
//
//*************************************************************************************************
#define GPIO_GPBCTRL_QUALPRD0_S 0U
#define GPIO_GPBCTRL_QUALPRD0_M \
    0xFFU // Qualification sampling period for GPIO32 to
          // GPIO39
#define GPIO_GPBCTRL_QUALPRD1_S 8U
#define GPIO_GPBCTRL_QUALPRD1_M \
    0xFF00U // Qualification sampling period for GPIO40 to
            // GPIO47
#define GPIO_GPBCTRL_QUALPRD2_S 16U
#define GPIO_GPBCTRL_QUALPRD2_M \
    0xFF0000U // Qualification sampling period for GPIO48 to
              // GPIO55
#define GPIO_GPBCTRL_QUALPRD3_S 24U
#define GPIO_GPBCTRL_QUALPRD3_M \
    0xFF000000U // Qualification sampling period for GPIO56 to
                // GPIO63

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBQSEL1 register
//
//*************************************************************************************************
#define GPIO_GPBQSEL1_GPIO32_S 0U
#define GPIO_GPBQSEL1_GPIO32_M 0x3U // Select input qualification type for GPIO32
#define GPIO_GPBQSEL1_GPIO33_S 2U
#define GPIO_GPBQSEL1_GPIO33_M 0xCU // Select input qualification type for GPIO33
#define GPIO_GPBQSEL1_GPIO34_S 4U
#define GPIO_GPBQSEL1_GPIO34_M 0x30U // Select input qualification type for GPIO34
#define GPIO_GPBQSEL1_GPIO35_S 6U
#define GPIO_GPBQSEL1_GPIO35_M 0xC0U // Select input qualification type for GPIO35
#define GPIO_GPBQSEL1_GPIO37_S 10U
#define GPIO_GPBQSEL1_GPIO37_M 0xC00U // Select input qualification type for GPIO37
#define GPIO_GPBQSEL1_GPIO39_S 14U
#define GPIO_GPBQSEL1_GPIO39_M 0xC000U // Select input qualification type for GPIO39
#define GPIO_GPBQSEL1_GPIO40_S 16U
#define GPIO_GPBQSEL1_GPIO40_M 0x30000U // Select input qualification type for GPIO40
#define GPIO_GPBQSEL1_GPIO41_S 18U
#define GPIO_GPBQSEL1_GPIO41_M 0xC0000U // Select input qualification type for GPIO41
#define GPIO_GPBQSEL1_GPIO42_S 20U
#define GPIO_GPBQSEL1_GPIO42_M 0x300000U // Select input qualification type for GPIO42
#define GPIO_GPBQSEL1_GPIO43_S 22U
#define GPIO_GPBQSEL1_GPIO43_M 0xC00000U // Select input qualification type for GPIO43
#define GPIO_GPBQSEL1_GPIO44_S 24U
#define GPIO_GPBQSEL1_GPIO44_M 0x3000000U // Select input qualification type for GPIO44
#define GPIO_GPBQSEL1_GPIO45_S 26U
#define GPIO_GPBQSEL1_GPIO45_M 0xC000000U // Select input qualification type for GPIO45
#define GPIO_GPBQSEL1_GPIO46_S 28U
#define GPIO_GPBQSEL1_GPIO46_M 0x30000000U // Select input qualification type for GPIO46
#define GPIO_GPBQSEL1_GPIO47_S 30U
#define GPIO_GPBQSEL1_GPIO47_M 0xC0000000U // Select input qualification type for GPIO47

