QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_gpio.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBQSEL2 register
//
//*************************************************************************************************
#define GPIO_GPBQSEL2_GPIO48_S 0U
#define GPIO_GPBQSEL2_GPIO48_M 0x3U // Select input qualification type for GPIO48
#define GPIO_GPBQSEL2_GPIO49_S 2U
#define GPIO_GPBQSEL2_GPIO49_M 0xCU // Select input qualification type for GPIO49
#define GPIO_GPBQSEL2_GPIO50_S 4U
#define GPIO_GPBQSEL2_GPIO50_M 0x30U // Select input qualification type for GPIO50
#define GPIO_GPBQSEL2_GPIO51_S 6U
#define GPIO_GPBQSEL2_GPIO51_M 0xC0U // Select input qualification type for GPIO51
#define GPIO_GPBQSEL2_GPIO52_S 8U
#define GPIO_GPBQSEL2_GPIO52_M 0x300U // Select input qualification type for GPIO52
#define GPIO_GPBQSEL2_GPIO53_S 10U
#define GPIO_GPBQSEL2_GPIO53_M 0xC00U // Select input qualification type for GPIO53
#define GPIO_GPBQSEL2_GPIO54_S 12U
#define GPIO_GPBQSEL2_GPIO54_M 0x3000U // Select input qualification type for GPIO54
#define GPIO_GPBQSEL2_GPIO55_S 14U
#define GPIO_GPBQSEL2_GPIO55_M 0xC000U // Select input qualification type for GPIO55
#define GPIO_GPBQSEL2_GPIO56_S 16U
#define GPIO_GPBQSEL2_GPIO56_M 0x30000U // Select input qualification type for GPIO56
#define GPIO_GPBQSEL2_GPIO57_S 18U
#define GPIO_GPBQSEL2_GPIO57_M 0xC0000U // Select input qualification type for GPIO57
#define GPIO_GPBQSEL2_GPIO58_S 20U
#define GPIO_GPBQSEL2_GPIO58_M 0x300000U // Select input qualification type for GPIO58
#define GPIO_GPBQSEL2_GPIO59_S 22U
#define GPIO_GPBQSEL2_GPIO59_M 0xC00000U // Select input qualification type for GPIO59

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBMUX1 register
//
//*************************************************************************************************
#define GPIO_GPBMUX1_GPIO32_S 0U
#define GPIO_GPBMUX1_GPIO32_M 0x3U // Defines pin-muxing selection for GPIO32
#define GPIO_GPBMUX1_GPIO33_S 2U
#define GPIO_GPBMUX1_GPIO33_M 0xCU // Defines pin-muxing selection for GPIO33
#define GPIO_GPBMUX1_GPIO34_S 4U
#define GPIO_GPBMUX1_GPIO34_M 0x30U // Defines pin-muxing selection for GPIO34
#define GPIO_GPBMUX1_GPIO35_S 6U
#define GPIO_GPBMUX1_GPIO35_M 0xC0U // Defines pin-muxing selection for GPIO35
#define GPIO_GPBMUX1_GPIO37_S 10U
#define GPIO_GPBMUX1_GPIO37_M 0xC00U // Defines pin-muxing selection for GPIO37
#define GPIO_GPBMUX1_GPIO39_S 14U
#define GPIO_GPBMUX1_GPIO39_M 0xC000U // Defines pin-muxing selection for GPIO39
#define GPIO_GPBMUX1_GPIO40_S 16U
#define GPIO_GPBMUX1_GPIO40_M 0x30000U // Defines pin-muxing selection for GPIO40
#define GPIO_GPBMUX1_GPIO41_S 18U
#define GPIO_GPBMUX1_GPIO41_M 0xC0000U // Defines pin-muxing selection for GPIO41
#define GPIO_GPBMUX1_GPIO42_S 20U
#define GPIO_GPBMUX1_GPIO42_M 0x300000U // Defines pin-muxing selection for GPIO42
#define GPIO_GPBMUX1_GPIO43_S 22U
#define GPIO_GPBMUX1_GPIO43_M 0xC00000U // Defines pin-muxing selection for GPIO43
#define GPIO_GPBMUX1_GPIO44_S 24U
#define GPIO_GPBMUX1_GPIO44_M 0x3000000U // Defines pin-muxing selection for GPIO44
#define GPIO_GPBMUX1_GPIO45_S 26U
#define GPIO_GPBMUX1_GPIO45_M 0xC000000U // Defines pin-muxing selection for GPIO45
#define GPIO_GPBMUX1_GPIO46_S 28U
#define GPIO_GPBMUX1_GPIO46_M 0x30000000U // Defines pin-muxing selection for GPIO46
#define GPIO_GPBMUX1_GPIO47_S 30U
#define GPIO_GPBMUX1_GPIO47_M 0xC0000000U // Defines pin-muxing selection for GPIO47

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBMUX2 register
//
//*************************************************************************************************
#define GPIO_GPBMUX2_GPIO48_S 0U
#define GPIO_GPBMUX2_GPIO48_M 0x3U // Defines pin-muxing selection for GPIO48
#define GPIO_GPBMUX2_GPIO49_S 2U
#define GPIO_GPBMUX2_GPIO49_M 0xCU // Defines pin-muxing selection for GPIO49
#define GPIO_GPBMUX2_GPIO50_S 4U
#define GPIO_GPBMUX2_GPIO50_M 0x30U // Defines pin-muxing selection for GPIO50
#define GPIO_GPBMUX2_GPIO51_S 6U
#define GPIO_GPBMUX2_GPIO51_M 0xC0U // Defines pin-muxing selection for GPIO51
#define GPIO_GPBMUX2_GPIO52_S 8U
#define GPIO_GPBMUX2_GPIO52_M 0x300U // Defines pin-muxing selection for GPIO52
#define GPIO_GPBMUX2_GPIO53_S 10U
#define GPIO_GPBMUX2_GPIO53_M 0xC00U // Defines pin-muxing selection for GPIO53
#define GPIO_GPBMUX2_GPIO54_S 12U
#define GPIO_GPBMUX2_GPIO54_M 0x3000U // Defines pin-muxing selection for GPIO54
#define GPIO_GPBMUX2_GPIO55_S 14U
#define GPIO_GPBMUX2_GPIO55_M 0xC000U // Defines pin-muxing selection for GPIO55
#define GPIO_GPBMUX2_GPIO56_S 16U
#define GPIO_GPBMUX2_GPIO56_M 0x30000U // Defines pin-muxing selection for GPIO56
#define GPIO_GPBMUX2_GPIO57_S 18U
#define GPIO_GPBMUX2_GPIO57_M 0xC0000U // Defines pin-muxing selection for GPIO57
#define GPIO_GPBMUX2_GPIO58_S 20U
#define GPIO_GPBMUX2_GPIO58_M 0x300000U // Defines pin-muxing selection for GPIO58
#define GPIO_GPBMUX2_GPIO59_S 22U
#define GPIO_GPBMUX2_GPIO59_M 0xC00000U // Defines pin-muxing selection for GPIO59

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBDIR register
//
//*************************************************************************************************
#define GPIO_GPBDIR_GPIO32 0x1U       // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO33 0x2U       // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO34 0x4U       // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO35 0x8U       // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO37 0x20U      // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO39 0x80U      // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO40 0x100U     // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO41 0x200U     // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO42 0x400U     // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO43 0x800U     // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO44 0x1000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO45 0x2000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO46 0x4000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO47 0x8000U    // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO48 0x10000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO49 0x20000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO50 0x40000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO51 0x80000U   // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO52 0x100000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO53 0x200000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO54 0x400000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO55 0x800000U  // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO56 0x1000000U // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO57 0x2000000U // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO58 0x4000000U // Defines direction for this pin in GPIO mode
#define GPIO_GPBDIR_GPIO59 0x8000000U // Defines direction for this pin in GPIO mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBPUD register
//
//*************************************************************************************************
#define GPIO_GPBPUD_GPIO32 0x1U       // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO33 0x2U       // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO34 0x4U       // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO35 0x8U       // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO37 0x20U      // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO39 0x80U      // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO40 0x100U     // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO41 0x200U     // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO42 0x400U     // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO43 0x800U     // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO44 0x1000U    // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO45 0x2000U    // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO46 0x4000U    // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO47 0x8000U    // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO48 0x10000U   // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO49 0x20000U   // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO50 0x40000U   // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO51 0x80000U   // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO52 0x100000U  // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO53 0x200000U  // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO54 0x400000U  // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO55 0x800000U  // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO56 0x1000000U // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO57 0x2000000U // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO58 0x4000000U // Pull-Up Disable control for this pin
#define GPIO_GPBPUD_GPIO59 0x8000000U // Pull-Up Disable control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBINV register
//
//*************************************************************************************************
#define GPIO_GPBINV_GPIO32 0x1U       // Input inversion control for this pin
#define GPIO_GPBINV_GPIO33 0x2U       // Input inversion control for this pin
#define GPIO_GPBINV_GPIO34 0x4U       // Input inversion control for this pin
#define GPIO_GPBINV_GPIO35 0x8U       // Input inversion control for this pin
#define GPIO_GPBINV_GPIO37 0x20U      // Input inversion control for this pin
#define GPIO_GPBINV_GPIO39 0x80U      // Input inversion control for this pin
#define GPIO_GPBINV_GPIO40 0x100U     // Input inversion control for this pin
#define GPIO_GPBINV_GPIO41 0x200U     // Input inversion control for this pin
#define GPIO_GPBINV_GPIO42 0x400U     // Input inversion control for this pin
#define GPIO_GPBINV_GPIO43 0x800U     // Input inversion control for this pin
#define GPIO_GPBINV_GPIO44 0x1000U    // Input inversion control for this pin
#define GPIO_GPBINV_GPIO45 0x2000U    // Input inversion control for this pin
#define GPIO_GPBINV_GPIO46 0x4000U    // Input inversion control for this pin
#define GPIO_GPBINV_GPIO47 0x8000U    // Input inversion control for this pin
#define GPIO_GPBINV_GPIO48 0x10000U   // Input inversion control for this pin
#define GPIO_GPBINV_GPIO49 0x20000U   // Input inversion control for this pin
#define GPIO_GPBINV_GPIO50 0x40000U   // Input inversion control for this pin
#define GPIO_GPBINV_GPIO51 0x80000U   // Input inversion control for this pin
#define GPIO_GPBINV_GPIO52 0x100000U  // Input inversion control for this pin
#define GPIO_GPBINV_GPIO53 0x200000U  // Input inversion control for this pin
#define GPIO_GPBINV_GPIO54 0x400000U  // Input inversion control for this pin
#define GPIO_GPBINV_GPIO55 0x800000U  // Input inversion control for this pin
#define GPIO_GPBINV_GPIO56 0x1000000U // Input inversion control for this pin
#define GPIO_GPBINV_GPIO57 0x2000000U // Input inversion control for this pin
#define GPIO_GPBINV_GPIO58 0x4000000U // Input inversion control for this pin
#define GPIO_GPBINV_GPIO59 0x8000000U // Input inversion control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBODR register
//
//*************************************************************************************************
#define GPIO_GPBODR_GPIO32 0x1U       // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO33 0x2U       // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO34 0x4U       // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO35 0x8U       // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO37 0x20U      // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO39 0x80U      // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO40 0x100U     // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO41 0x200U     // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO42 0x400U     // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO43 0x800U     // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO44 0x1000U    // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO45 0x2000U    // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO46 0x4000U    // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO47 0x8000U    // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO48 0x10000U   // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO49 0x20000U   // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO50 0x40000U   // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO51 0x80000U   // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO52 0x100000U  // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO53 0x200000U  // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO54 0x400000U  // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO55 0x800000U  // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO56 0x1000000U // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO57 0x2000000U // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO58 0x4000000U // Output Open-Drain control for this pin
#define GPIO_GPBODR_GPIO59 0x8000000U // Output Open-Drain control for this pin

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBGMUX1 register
//
//*************************************************************************************************
#define GPIO_GPBGMUX1_GPIO32_S 0U
#define GPIO_GPBGMUX1_GPIO32_M 0x3U // Defines pin-muxing selection for GPIO32
#define GPIO_GPBGMUX1_GPIO33_S 2U
#define GPIO_GPBGMUX1_GPIO33_M 0xCU // Defines pin-muxing selection for GPIO33
#define GPIO_GPBGMUX1_GPIO34_S 4U
#define GPIO_GPBGMUX1_GPIO34_M 0x30U // Defines pin-muxing selection for GPIO34
#define GPIO_GPBGMUX1_GPIO35_S 6U
#define GPIO_GPBGMUX1_GPIO35_M 0xC0U // Defines pin-muxing selection for GPIO35
#define GPIO_GPBGMUX1_GPIO37_S 10U
#define GPIO_GPBGMUX1_GPIO37_M 0xC00U // Defines pin-muxing selection for GPIO37
#define GPIO_GPBGMUX1_GPIO39_S 14U
#define GPIO_GPBGMUX1_GPIO39_M 0xC000U // Defines pin-muxing selection for GPIO39
#define GPIO_GPBGMUX1_GPIO40_S 16U
#define GPIO_GPBGMUX1_GPIO40_M 0x30000U // Defines pin-muxing selection for GPIO40
#define GPIO_GPBGMUX1_GPIO41_S 18U
#define GPIO_GPBGMUX1_GPIO41_M 0xC0000U // Defines pin-muxing selection for GPIO41
#define GPIO_GPBGMUX1_GPIO42_S 20U
#define GPIO_GPBGMUX1_GPIO42_M 0x300000U // Defines pin-muxing selection for GPIO42
#define GPIO_GPBGMUX1_GPIO43_S 22U
#define GPIO_GPBGMUX1_GPIO43_M 0xC00000U // Defines pin-muxing selection for GPIO43
#define GPIO_GPBGMUX1_GPIO44_S 24U
#define GPIO_GPBGMUX1_GPIO44_M 0x3000000U // Defines pin-muxing selection for GPIO44
#define GPIO_GPBGMUX1_GPIO45_S 26U
#define GPIO_GPBGMUX1_GPIO45_M 0xC000000U // Defines pin-muxing selection for GPIO45
#define GPIO_GPBGMUX1_GPIO46_S 28U
#define GPIO_GPBGMUX1_GPIO46_M 0x30000000U // Defines pin-muxing selection for GPIO46
#define GPIO_GPBGMUX1_GPIO47_S 30U
#define GPIO_GPBGMUX1_GPIO47_M 0xC0000000U // Defines pin-muxing selection for GPIO47

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBGMUX2 register
//
//*************************************************************************************************
#define GPIO_GPBGMUX2_GPIO48_S 0U
#define GPIO_GPBGMUX2_GPIO48_M 0x3U // Defines pin-muxing selection for GPIO48
#define GPIO_GPBGMUX2_GPIO49_S 2U
#define GPIO_GPBGMUX2_GPIO49_M 0xCU // Defines pin-muxing selection for GPIO49
#define GPIO_GPBGMUX2_GPIO50_S 4U
#define GPIO_GPBGMUX2_GPIO50_M 0x30U // Defines pin-muxing selection for GPIO50
#define GPIO_GPBGMUX2_GPIO51_S 6U
#define GPIO_GPBGMUX2_GPIO51_M 0xC0U // Defines pin-muxing selection for GPIO51
#define GPIO_GPBGMUX2_GPIO52_S 8U
#define GPIO_GPBGMUX2_GPIO52_M 0x300U // Defines pin-muxing selection for GPIO52
#define GPIO_GPBGMUX2_GPIO53_S 10U
#define GPIO_GPBGMUX2_GPIO53_M 0xC00U // Defines pin-muxing selection for GPIO53
#define GPIO_GPBGMUX2_GPIO54_S 12U
#define GPIO_GPBGMUX2_GPIO54_M 0x3000U // Defines pin-muxing selection for GPIO54
#define GPIO_GPBGMUX2_GPIO55_S 14U
#define GPIO_GPBGMUX2_GPIO55_M 0xC000U // Defines pin-muxing selection for GPIO55
#define GPIO_GPBGMUX2_GPIO56_S 16U
#define GPIO_GPBGMUX2_GPIO56_M 0x30000U // Defines pin-muxing selection for GPIO56
#define GPIO_GPBGMUX2_GPIO57_S 18U
#define GPIO_GPBGMUX2_GPIO57_M 0xC0000U // Defines pin-muxing selection for GPIO57
#define GPIO_GPBGMUX2_GPIO58_S 20U
#define GPIO_GPBGMUX2_GPIO58_M 0x300000U // Defines pin-muxing selection for GPIO58
#define GPIO_GPBGMUX2_GPIO59_S 22U
#define GPIO_GPBGMUX2_GPIO59_M 0xC00000U // Defines pin-muxing selection for GPIO59

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL1 register
//
//*************************************************************************************************
#define GPIO_GPBCSEL1_GPIO32_S 0U
#define GPIO_GPBCSEL1_GPIO32_M 0xFU // GPIO32 Master CPU Select
#define GPIO_GPBCSEL1_GPIO33_S 4U
#define GPIO_GPBCSEL1_GPIO33_M 0xF0U // GPIO33 Master CPU Select
#define GPIO_GPBCSEL1_GPIO34_S 8U
#define GPIO_GPBCSEL1_GPIO34_M 0xF00U // GPIO34 Master CPU Select
#define GPIO_GPBCSEL1_GPIO35_S 12U
#define GPIO_GPBCSEL1_GPIO35_M 0xF000U // GPIO35 Master CPU Select
#define GPIO_GPBCSEL1_GPIO37_S 20U
#define GPIO_GPBCSEL1_GPIO37_M 0xF00000U // GPIO37 Master CPU Select
#define GPIO_GPBCSEL1_GPIO39_S 28U
#define GPIO_GPBCSEL1_GPIO39_M 0xF0000000U // GPIO39 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL2 register
//
//*************************************************************************************************
#define GPIO_GPBCSEL2_GPIO40_S 0U
#define GPIO_GPBCSEL2_GPIO40_M 0xFU // GPIO40 Master CPU Select
#define GPIO_GPBCSEL2_GPIO41_S 4U
#define GPIO_GPBCSEL2_GPIO41_M 0xF0U // GPIO41 Master CPU Select
#define GPIO_GPBCSEL2_GPIO42_S 8U
#define GPIO_GPBCSEL2_GPIO42_M 0xF00U // GPIO42 Master CPU Select
#define GPIO_GPBCSEL2_GPIO43_S 12U
#define GPIO_GPBCSEL2_GPIO43_M 0xF000U // GPIO43 Master CPU Select
#define GPIO_GPBCSEL2_GPIO44_S 16U
#define GPIO_GPBCSEL2_GPIO44_M 0xF0000U // GPIO44 Master CPU Select
#define GPIO_GPBCSEL2_GPIO45_S 20U
#define GPIO_GPBCSEL2_GPIO45_M 0xF00000U // GPIO45 Master CPU Select
#define GPIO_GPBCSEL2_GPIO46_S 24U
#define GPIO_GPBCSEL2_GPIO46_M 0xF000000U // GPIO46 Master CPU Select
#define GPIO_GPBCSEL2_GPIO47_S 28U
#define GPIO_GPBCSEL2_GPIO47_M 0xF0000000U // GPIO47 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL3 register
//
//*************************************************************************************************
#define GPIO_GPBCSEL3_GPIO48_S 0U
#define GPIO_GPBCSEL3_GPIO48_M 0xFU // GPIO48 Master CPU Select
#define GPIO_GPBCSEL3_GPIO49_S 4U
#define GPIO_GPBCSEL3_GPIO49_M 0xF0U // GPIO49 Master CPU Select
#define GPIO_GPBCSEL3_GPIO50_S 8U
#define GPIO_GPBCSEL3_GPIO50_M 0xF00U // GPIO50 Master CPU Select
#define GPIO_GPBCSEL3_GPIO51_S 12U
#define GPIO_GPBCSEL3_GPIO51_M 0xF000U // GPIO51 Master CPU Select
#define GPIO_GPBCSEL3_GPIO52_S 16U
#define GPIO_GPBCSEL3_GPIO52_M 0xF0000U // GPIO52 Master CPU Select
#define GPIO_GPBCSEL3_GPIO53_S 20U
#define GPIO_GPBCSEL3_GPIO53_M 0xF00000U // GPIO53 Master CPU Select
#define GPIO_GPBCSEL3_GPIO54_S 24U
#define GPIO_GPBCSEL3_GPIO54_M 0xF000000U // GPIO54 Master CPU Select
#define GPIO_GPBCSEL3_GPIO55_S 28U
#define GPIO_GPBCSEL3_GPIO55_M 0xF0000000U // GPIO55 Master CPU Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL4 register
//
//*************************************************************************************************
#define GPIO_GPBCSEL4_GPIO56_S 0U
#define GPIO_GPBCSEL4_GPIO56_M 0xFU // GPIO56 Master CPU Select
#define GPIO_GPBCSEL4_GPIO57_S 4U
#define GPIO_GPBCSEL4_GPIO57_M 0xF0U // GPIO57 Master CPU Select
#define GPIO_GPBCSEL4_GPIO58_S 8U
#define GPIO_GPBCSEL4_GPIO58_M 0xF00U // GPIO58 Master CPU Select
#define GPIO_GPBCSEL4_GPIO59_S 12U
#define GPIO_GPBCSEL4_GPIO59_M 0xF000U // GPIO59 Master CPU Select

